@extends('layouts.category_game')

@php
    $mainUrl = '/main';
@endphp

@section('content')
    <div class="bg-white w-full flex-grow rounded-t-[50px] px-6 flex flex-col">
        <div class="text-center">
            <h2 class="text-4xl font-bold text-indigo-800 pr-4 pl-4">FAQs</h2>
        </div>
        @php
            $faqCategories = [
                [
                    'title' => 'พฤติกรรมการรังแกกัน',
                    'items' => [
                        [
                            'question' => '"บูลลี่" หรือ "การรังแกกัน" คือ?',
                            'answer' =>
                                'เป็นพฤติกรรมก้าวร้าว รุนแรง ตั้งใจ ทำให้คนที่ถูกกระทำ (เหยื่อ) ได้รับผลกระทบทางลบทั้งทางร่างกายหรือจิตใจ มีการทำซ้ำ ติดต่อกันเป็นระยะเวลาหนึ่ง โดยที่ผู้รังแกมีอำนาจเหนือกว่าเหยื่อนั่นเอง <br><div class="text-center mt-2 font-bold text-lg">รุนแรง+ตั้งใจ+อำนาจเหนือกว่า</div>',
                        ],
                        [
                            'question' => 'แบบไหนถึงเรียกว่าบลูลี่?',
                            'answer' =>
                                '<div class="text-center font-bold mb-1 text-lg">การรังแกแบ่งเป็น "หลัก 3 จ" </div>1. เจตนา คือ ลงมือแกล้ง กระทำต่อเหยื่อ <br>2. เจ็บปวด ทั้งเจ็บกายและเจ็บใจ ที่อีกฝ่ายไม่สนุกด้วย <br>3. จงใจทำซ้ำ แม้ว่าเหยื่อจะเคยปฏิเสธว่าไม่ชอบ ก็ยังคงทำอยู่ดี เป็นวงจรซ้ำๆ',
                        ],
                        [
                            'question' => 'การบลูลี่มีกี่ประเภท?',
                            'answer' =>
                                '<div class="font-bold text-lg text-center">4 ประเภท</div> <div class="text-lg text-center">1.ทางร่างกาย &nbsp;&nbsp;2.ทางวาจา <br>3.ทางสังคม &nbsp;&nbsp;4.ทางไซเบอร์ </div>',
                        ],
                        [
                            'question' => 'ตัวอย่างการรังแกทางร่างกาย',
                            'answer' =>
                                '-ทางร่างกาย เช่น การเตะ ถีบต่อย ตบหัว ขัดขา <br>-ทางเพศ โดยการแตะเนื้อตัว ลวนลาม ใช้กำลังเพื่อกอด จูบ มีเพศสัมพันธ์ คุกคามทำให้เรารู้สึกไม่ปลอดภัย <br>-ทรัพย์สิน การขโมยทรัพย์สินของเราทำให้เสียหาย เช่น เอารองเท้าของเราไปซ่อน ไถเงิน เป็นต้น',
                        ],
                        [
                            'question' => 'ตัวอย่างการรังแกทางวาจา',
                            'answer' =>
                                '<div class="text-center font-bold mb-1 ml-2 mr-2 text-lg">คำพูดที่ทำร้ายอารมณ์ ความรู้สึก จิตใจ </div> <div class="ml-2 mr-2">-การล้อเลียนชื่อพ่อแม่ รูปร่างหน้าตา เชื้อชาติ ความบกพร่อง <br>-หยาบคาย ข่มขู่ คุกคาม <br>-ซุบซิบนินทา <br>-พูดจาเหน็บแนม ด่าทอ ประชดประชัน</div>',
                        ],
                        [
                            'question' => 'ตัวอย่างการรังแกทางสังคม',
                            'answer' =>
                                '<div class="text-center font-bold mb-1 text-lg">ความสัมพันธ์ เพื่อน กลุ่ม สังคม </div> <div class="ml-2">-การกีดกันออกจากกลุ่มเพื่อน <br>-รวมกลุ่มกันแบนหรือไม่พูดด้วย</div>',
                        ],
                        [
                            'question' => 'ตัวอย่างการรังแกทางไซเบอร์',
                            'answer' =>
                                '<div class="text-center font-bold mb-1  ml-2 mr-2 text-lg">การระรานหรือการกลั่นแกล้งทางช่องทางออนไลน์</div> <div class="ml-2 mr-2">-การ Comment ไม่สุภาพ (วิจารณ์รูปร่าง การเหยียดชาติพันธุ์ คุกตามทางเพศ) <br>-สร้าง account ปลอม (แอคหลุ่ม)ต่างๆ เพื่อหลอกลวง</div>',
                        ],
                        [
                            'question' => 'ลักษณะของการรังแกทางไซเบอร์เป็นอย่างไรบ้างนะ?',
                            'answer' =>
                                '<div class="text-center font-bold mb-1 text-lg">ประกอบด้วยหลัก 2 A </div> <div class="ml-2 mr-2">-1. Anonymous ความเป็นนิรนาม การไม่ระบุตัวตัว เราไม่รู้จักว่าผู้ที่คุกคามเราทางออนไลน์เป็นใคร <br>-2. Any place and time เกิดได้ทุกที่ ทุกเวลา 24 ชั่วโมง ที่ไหนก็ได้ในโลก เพียงแค่มีอินเตอร์เน็ตเชื่อมต่อ มีการแชร์ มีการแคป มีการส่งต่อ แพร่กระจายไปอย่างรวดเร็ว <br><br> ดังนั้นจึงจัดได้ว่า การรังแกทางไซเบอร์เป็นปัญหาที่เรื้อรัง </div>',
                        ],
                    ],
                ],
                [
                    'title' => 'สาเหตุการกลั่นแกล้ง',
                    'items' => [
                        [
                            'question' => 'สาเหตุของการกลั่นแกล้งบนโลกออนไลน์ เกิดจากอะไร?',
                            'answer' =>
                                '-สามารถเกิดได้หลากหลาย แต่ส่วนมากเกิดขึ้นจากความเกลียดชังและจงใจที่จะล้อเลียน เพื่อทำให้เป้าหมายเกิดความอับอายบนโลกไซเบอร์ <br>-มีทั้งทำครั้งเดียวเพื่อความสะใจแล้วหายไปและการจงใจตามคุกคามเป็นระยะเวลานานๆ แบบล็อคเป้าหมายจนกว่าจะพอใจ',
                        ],
                        [
                            'question' => 'ผลกระทบของผู้ที่รังแกทางไซเบอร์?',
                            'answer' =>
                                '-เด็กที่รังแกผู้อื่นจะเคยชินกับการละเมิดกฎ มีพฤติกรรมต่อต้านสังคม โตขึ้นจะเสี่ยงต่อการเป็นอันธพานนำไปสู่กระบวนการทางกฎหมายในอนาคต <br>-การนำความรุนแรงไปใช้ในครอบครัว กลายเป็นวัฏจักรส่งผลถึงลูกหลานให้เคยชินกับการใช้ความรุนแรงด้วย <br>-มีแนวโน้มการการใช้สารเสพติดต่างๆ',
                        ],
                        [
                            'question' => 'ผลกระทบของผู้ถูกรังแกทางไซเบอร์?',
                            'answer' =>
                                '-เด็กที่ถูกรังแกจะเสี่ยงต่อที่จะเผชิญกับภาวะวิตกกังวล หวาดระแวง รู้สึกไม่ปลอดภัย รวมถึงสูญเสียความมั่นใจในตัวเอง <br>-นำไปสู่ภาวะซึมเศร้าและบางรายอาจจะทำร้ายตัวเอง/ฆ่าตัวตายจนจบชีวิตเลยก็มีครับเพราะทนความกดดันจากการถูกรังแกไม่ไหว',
                        ],
                        [
                            'question' => 'การ Cyberbullying ผิดกฎหมายหรือไม่?',
                            'answer' => 'การ Cyberbullying สามารถผิดกฎหมายได้ขึ้นอยู่กับลักษณะการกระทำ เช่น การข่มขู่คุกคาม การแพร่ภาพโดยไม่ได้รับอนุญาต การสร้างความเสียหายต่อชื่อเสียง ซึ่งอาจเข้าข่ายความผิดตามพระราชบัญญัติคอมพิวเตอร์ พ.ศ. 2560 หรือประมวลกฎหมายอาญา',
                        ],
                        [
                            'question' => 'บทบาทผู้ที่เกี่ยวข้องกับการรังแกกันทางไซเบอร์?',
                            'answer' =>
                                '<div class="text-center font-bold text-lg">การรังแกทางไซเบอร์</div> <div class="ml-2 mr-2">1.ผู้รังแก (bully) <br>2.ผู้ถูกรังแก/เหยื่อ (Victim)</div> <div class="text-center font-bold text-lg mt-2">การรังแกแบบทั่วไป</div> <div class="ml-2 mr-2">3.ผู้เห็นเหตุการณ์ (Bystander)</div>',
                        ],
                        [
                            'question' => 'สัญญานเตือนภัยของผู้ถูกกระทำ',
                            'answer' =>
                                '<div class="text-center font-bold text-lg">เพื่อน คุณครู ผู้ปกครอง สามารถสังเกตได้</div> -หลีกหนีสถานการณ์ทางสังคม <br>-ไม่อยากไปโรงเรียน <br>-เก็บตัว ไม่อยากสุงสิงกับใคร <br>-มีมุมมองต่อตัวเองในแง่ลบ เช่น ฉันอ่อนแอ ไม่มีทางสู้',
                        ],
                        [
                            'question' => 'สัญญานเตือนภัยของผู้กระทำ',
                            'answer' =>
                                '-คบหากับเพื่อนที่รังแกคนอื่น มีความก้าวร้าวมากขึ้น <br>-ดูรวยขึ้น มีไอเท็มเจ๋งๆ มาโรงเรียนทุกวัน <br>-ไม่รับผิดชอบการกระทำตนเอง ตำหนิผู้อื่น',
                        ],
                    ],
                ],
                [
                    'title' => 'การรับมือการกลั่นแกล้ง',
                    'items' => [
                        [
                            'question' => 'วิธีการใช้อินเตอร์เน็ตอย่างปลอดภัย',
                            'answer' =>
                                '-ไม่บอกพาสเวิร์ดให้เพื่อนในกลุ่มเดียวกันได้รู้ <br>-ไม่ต่อ Wi-Fi สาธารณะเมื่อใช้งาน internet banking <br>-ไม่คลิกดาวโหลด link จาก SMS ที่บอกว่ามาจากธนาคาร <br>-เลือกไม่จำรหัสผ่านเมื่อใช้งานคอมพิวเตอร์ในโรงเรียน <br>-Log out ออกจากบัญชีออนไลน์ต่างๆ <br>-ปิดการแชร์ตำแหน่ง (check in) ว่านักเรียนทำอะไรอยู่ที่ไหน',
                        ],
                        [
                            'question' => 'เทคนิคการตั้งชื่อ password ที่ปลอดภัย',
                            'answer' =>
                                '-AwesomeWonderland985!  <span class="text-green-600 font-bold">(✓ ปลอดภัย)</span> <br>-Thapa2532 <span class="text-red-600 font-bold">(✗ ไม่ปลอดภัย)</span> ชื่อและปีพ.ศ.เกิด <br>-05012532 <span class="text-red-600 font-bold">(✗ ไม่ปลอดภัย)</span> วันเดือนปีเกิด',
                        ],
                        [
                            'question' => 'วิธีการรับมือกับ Cyberbullying',
                            'answer' =>
                                '1.<strong>Stop</strong> หยุดการกระทำทุกอย่าง: นิ่งเฉยไม่ตอบโต้ เพื่อไม่ให้เกิดการกระทำซ้ำ หรือเพิ่มความรุนแรง ใช้ในกรณีที่เป็นเหตุการณ์ทะเลาะเบาะแว้งในขั้นเริ่มต้นแล้วค่อยไปปรับความเข้าใจกันภายหลัง เช่น โดนแซวเล็กน้อย <br>2.<strong>Block</strong> ปิดกั้นพวกเขา: บล็อกผู้กลั่นแกล้ง เพื่อไม่ให้ถูกกระทำซ้ำ <br>3.<strong>Tell</strong> บอกบุคคลที่ไว้ใจได้: บอกผู้ปกครอง ครู หรือบุคคลที่ไว้ใจเพื่อขอความช่วยเหลือ และแคปเก็บบันทึกหลักฐาน <br>4.<strong>Remove</strong> ลบภาพที่เป็นการระรานออกทันที: ลบภาพ ข้อความ วิดีโอ ที่เป็นการระรานออกทันที หรืออาจจะติดต่อเจ้าหน้าที่ที่เป็นเจ้าของพื้นที่นั้น เช่น การกดปุ่มรายงานเนื้อหาบน Facebook IG และ TikTok <br>5.<strong>Be strong</strong>: เข้มแข็ง อดทน และมั่นใจในคุณค่าของตนเอง ไม่ให้คุณค่ากับคนหรือคำพูดที่ทำร้ายเรา',
                        ],
                        [
                            'question' => 'ช่องทางการขอความช่วยเหลือ',
                            'answer' =>
                                '1.ต้องการปรึกษาคุณครูที่โรงเรียน <a href="https://line.me/R/ti/p/@teacher_school" target="_blank" class="text-blue-600 underline hover:text-blue-800">คลิกที่นี่</a> <br>2.ต้องการปรึกษาพี่ๆนักวิจัย <a href="{{ route(\'researcher.consultation\') }}" class="text-blue-600 underline hover:text-blue-800">คลิกที่นี่</a> <br>3.ขอคำปรึกษาจากหน่วยงานในจังหวัดเชียงราย <a href="{{ route(\'local.help\') }}" class="text-blue-600 underline hover:text-blue-800">คลิกที่นี่</a> <br>4.ขอคำปรึกษาจากหน่วยงานในประเทศไทย (ส่วนกลาง) <a href="{{ route(\'national.help\') }}" class="text-blue-600 underline hover:text-blue-800">คลิกที่นี่</a>',
                        ],
                        [
                            'question' => 'สิ่งที่อยากบอกให้น้องๆ เข้าใจ',
                            'answer' =>
                                '-ควบคุมอารมณ์ คิดไตรตรองก่อนโพสต์ข้อความ <br>-การรังแกทางไซเบอร์มีผลกระทบที่รุนแรงมากกว่าที่คิด <br>-ผู้ใช้อินเตอร์เน็ตควรฝึกความเห็นอกเห็นใจซึ่งกันและกัน เพื่อป้องกันการเผลอไปทำร้ายความรู้สึกใครโดยไม่ตั้งใจ <br>-เพราะอาจสื่อสารคลาดเคลื่อนจากการไม่ได้รับรู้น้ำเสียง',
                        ],
                    ],
                ],
            ];
        @endphp

        @foreach ($faqCategories as $category)
            @include('layouts.faq.category', ['category' => $category])
        @endforeach
    </div>

    @endsection

@section('scripts')
    @include('layouts.faq.script')
@endsection
